xtee6/center-service/test/resources/client_reg_request_LOCAL.soap

<?xml version="1.0" encoding="utf-8" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"><SOAP-ENV:Header><xroad:client id:objectType="MEMBER"><id:xRoadInstance>EE</id:xRoadInstance><id:memberClass>GOV</id:memberClass><id:memberCode>TS1OWNER</id:memberCode></xroad:client><xroad:service id:objectType="SERVICE"><id:xRoadInstance>EE</id:xRoadInstance><id:memberClass>GOV</id:memberClass><id:memberCode>TS1OWNER</id:memberCode><id:serviceCode>clientReg</id:serviceCode></xroad:service><xroad:userId>proxyUi</xroad:userId><xroad:id>910a9d0a-8666-4541-86e9-6409346c2eb4</xroad:id><xroad:protocolVersion>4.0</xroad:protocolVersion></SOAP-ENV:Header><SOAP-ENV:Body><xroad:clientReg><xroad:server id:objectType="SERVER"><id:xRoadInstance>EE</id:xRoadInstance><id:memberClass>GOV</id:memberClass><id:memberCode>TS1OWNER</id:memberCode><id:serverCode>TS1</id:serverCode></xroad:server><xroad:client id:objectType="MEMBER"><id:xRoadInstance>EE</id:xRoadInstance><id:memberClass>COM</id:memberClass><id:memberCode>CHANGEIT3</id:memberCode></xroad:client></xroad:clientReg></SOAP-ENV:Body></SOAP-ENV:Envelope>
